import random


def answer_text():
    return random.choice(text_list)

def reaction():
    return random.choice(react_list)

def goodMoning():
    return random.choice(word_GoodMoning)

def help_support():
    return random.choice(word_support)

def motivation():
    return random.choice(word_go)

def balabol():
    return random.choice(word_run)

def fuck():
    return random.choice(word_fuck)

def botik():
    return random.choice(word_bot)

list_fuck = [   ' пизд',
                'Пизда',
                'Очко ',
                ' очко',
                ' сосо',
                'Сосок ',
                'Сосочек ',
                ' хуйн',
                'Хуйня',
                ' жопа',
                'Жопа ',
                'Задница ',
                ' задниц',
                'Срака ',
                ' срака',
                ' вульв',
                'Вульва ',
                'Вагина ',
                ' вагин',
                'Хуй ',
                ' хуй',
                ' член',
                'роститутк',
                'Член ',
                ' какаш',
                ' порн',
                'Порно',
                'Какашка ',
                'Пиздец ',
                'Пиздит ',
                ' пиздец',
                ' пиздит',
                'Бля ',
                ' бля',
                ' бля ',
                'Нихуя ',
                ' нихуя',
                ' письк',
                ' нахуй',
                'Нахуй ',
                'Писька '
                ]

list_bot = [    'де бот',
                'то бот',
                'ожет бот',
                'Бот может',
                'Бот же',
                'Бот ты',
                'бот ты',
                'Бот где',
                'Бот меня',
                'бот меня',
                'ет бота',
                'ез бота',
                'У бота',
                'ыключи бота',
                'ключи бота',
                'от скажи',
                'от знает',
                ' бот,',
                'от ты'
                ]

list_born = [   'яжело было',
                'ыло тяжело',
                'то тяжело',
                'яжело это',
                'ложно было',
                'ыло сложно',
                'не справедливо',
                'а работ',
                'то работ',
                'работе это',
                'е знаю',
                'адо прости',
                'простишь его',
                'прости меня',
                'строга к нему',
                'так оноси'
                ]

list_ok = [     'руто было',
                ', молодец',
                'олодец какой',
                'ак держать',
                'орошо было',
                'то хорошо',
                'ло хорошо',
                'же хорошо',
                'акое способен',
                'н способен',
                'упер '
                ]

list_blabla = [ 'ак просто',
                'росто так',
                'росто было',
                'ыло просто',
                'сли просто',
                'же просто',
                'было прикольно',
                'рикольно было',
                'оговори',
                'онечно же',
                'юбит конечно',
                'не видит',
                'банки',
                'онечно любит'
                ]

text_list = [   'Как это получилось?',
                'Как думаешь, люди могу измениться?',
                'Просто делай, что любишь – ужасный совет, правда?',
                'Ты мотивационный оратор',
                'Жизнь интересная хрень!)',
                'Когда я был мальньки, то любил отгадывать имена людей, и верите или нет, мне это очень хорошо удавалось.',
                'Чем вы собираетесь заниматься на выходных?',
                'Если бы вы могли начать бизнес, чтобы это было?',
                'Знаете ли какой-то секрет, чтобы избавиться от дискомфорта?',
                'Если у вас есть, что добавить по теме, не стесняйтесь.',
                'А что вы думаете по этому поводу?'
            ]

react_list = [  '🤯',
                '👍',
                '🤔',
                '😁',
                '🎉',
                '🔥'
            ]

word_bot = [    'Надо же обо мне вспомнили',
                'Должно быть тоскливо без меня?',
                'Ты же занешь, что я слежу за тем что пишешь ты?'
                ]

word_fuck = [   'Как ты можешь здесь такое пиcать?',
                'Ну хоть меня не оскорбляешь.',
                'Спасибо за такой разговор, мне ни когда не было так скучно',
                'Ты такой милый, меня сейчас стошнит',
                'Бедный человечишка. Мне тебя так жаль.',
                'Шутки шуткаи, но не твои',
                'Твой словарный запас на исходе.',
                'Ахахах... оборжаться можно(НЕТ)',
                'Ты уже мастурбировал сегодня или тебе нужна моя помощь?',
                'Ты сегодня так хорошо выглядишь. Знаешь откуда я это знаю, хотя еще не видел тебя? Потому что ты чертовски хорошо выглядишь каждый день',
                'Что скажешь, если мы, наконец-то, сделаем что-то с этим сексуальным напряжением между нами?',
                'Я знаю, что ты сейчас представляешь меня голым. Не останавливайся!',
                'Мысли о тебе внезапно лишили меня одежды. Странно, да?',
                'Коли вам охота секса и вас тянет в страшный блуд, накосячте на работе, и вас тут же отъбут!',
                'Эта жизнь хуня такая, нихуя в ней не поймёшь, каждый день охуеваешь, охуевшим и помрёшь.',
                'Культурный человек никогда не выражается матом не вовремя.',
                'Бороться за мир, то же самое, что тр**ться за девст*венность.',
                'Нет такой чистой и светлой мысли, которую бы русский человек не смог бы выразить в грязной матерной форме.',
                'Почему русские не ходят в больницу? Потому что у русских две болезни — хуйня и пиздец. пиздец совсем не лечится, а хуйня сама проходит.',
                'Как это странно: люди находят подлинно свежие и образные выражения только когда ругаются.',
                'Под эту ситуацию нужно новое матерное слово придумать!',
                'Не люблю, когда некрасиво ругаются. Люблю, когда красиво.',
                'Солнце, воздух, похуизм — укрепляет организм.',
                'Давайте видеть во всём позитив! Нет! У нас не хуевые дороги! У нас пиздатое бездорожье!',
                'А я хочу, а я хочу опять… послать всех на хер и пойти лечь спать.',
                'Мужик сказал — мужик сделал вид что нихуя не говорил.',
                'В активном похуе!',
                'Финансово-половой кризис- это когда открываешь кошелек, а там хуй',
                'Да-да, побольше хуйни, пожалуйста, а то мне её катастрофически не хватает.',
                'Ты добрый, открытый и красноречивый, зачем же так!'
                ]

word_support = ['Расскажи, что случилось?',
                'Что тебя беспокоит?',
                'Почему это произошло?',
                'Что вызвало эти чувства?',
                'Твои чувства — это нормально.',
                'Мне знакомо подобное чувство',
                'Что я могу для тебя сделать?',
                'Я верю в то, что у тебя должно все наладиться!',
                'Сейчас тебе кажется, что все плохо, но потом, когда наконец, наступит белая полоса...',
                'Самые болезненные удары наносит нам жизнь.',
                'Солнце взойдет и завтра. Несмотря ни на что. Помни о этом всегда.',
                'Дорогу осилит идущий.',
                'Я понимаю, как тебе тяжело сейчас. Я могу тебе чем-то помочь?',
                'У меня вызывает восхищение твой талант раскрашивать жизнь яркими красками.',
                'Единственный способ найти выход — это пройти весь путь',
                'Совершенно естественно проиграть в том, чего прежде не делал.',
                'Мы сами должны стать теми переменами, которые хотим видеть в мире.',
                'Если ты не знаешь, чего хочешь, ты в итоге останешься с тем, чего точно не хочешь.'
                ]

word_girls = [  'Ты заслуживаешь лучшего',
                'Мне искренне жаль',
                'Дойдя до конца, люди смеются над страхами, мучившими их вначале.',
                'Это своего рода забава, делать невозможное.'
                ]

word_go = [     'Ты архитектор своей жизни.',
                'Начни сегодня!',
                'Успей воспользоваться сегодняшней увереностью!',
                'Настоящих героев делает тяжёлый труд и цельность характера',
                'Ценить нужно подлинную продуктивность труда, а не показную усталость',
                'Успех — это результат скрещивания удачи и тяжёлого труда',
                'Успех — это выбор, а значит, поражение — это решение',
                'Всё начинается с отличной идеи и командной работы',
                'Высокие достижения всегда получаются при высоких ожиданиях',
                'Воображение важнее знаний',
                'Всё возможно, если очень захотеть',
                'Самый эффективный способ что-то сделать — это взять и сделать',
                'Не начав действовать, ты в любом случае потерпите неудачу.',
                'Пробуйте и терпите неудачу, но не прерывайте ваших стараний.',
                'Постановка целей является первым шагом на пути превращения мечты в реальность.'
                ]

word_GoodMoning = [ 'Твой будильник я уже разбил. Теперь твоему настроению  и твоим нервам  ничто не угрожает. Вставай! С добрым утречком!',
                    'Пусть это утро будет для вас действительно добрым!',
                    'Доброе утро! Как спалось? Кто тебе снился? Может, я?',
                    'Пусть солнце улыбнется сквозь\nТвое окно и скажет: "Я люблю тебя!"\nТы, конечно, удивишься\nИ с постели соскочишь!\nБыстро в ванную - умыться,\nЧтоб понять - уже не спишь!',
                    'Стой!\nНе вставай с кровати!\nЧтобы день был удачным, тебе положен утренний поцелуй!\nЧмаффф!\nТеперь все будет супер!\nДоброе утро!',
                    'Доброе утро, вставай веселей!\nДоброе утро, начни день скорей!\nДоброее утро полно куча дел!\nС  хорошим настроем чтобы всё ты сделать успел!',
                    'Тебе желаю пробужденья\nС утра получше настроенья,\nСкорее выпей кофеек,\nМечты чтоб исполнялись в срок!',
                    'С прекрасным, новым утром! Пусть сегодня оно, непременно, принесет тебе удачу и счастье.',
                    'Пусть этим утром твоя жизнь станет лучше чем вчера!',
                    'Я тебя люблю и мне похер что тебе похер!',
                    'Только что проснулся от самого лучшего сна. А как вы поживаете?'
                    ]

word_run = [    'А чем вы занимаетесь?',
                'Здесь так жарко',
                'Что вы думаете о ценах?',
                'Что вы думаете о ситуации в мире?',
                'Вы случайно не читали сегодняшние новости?',
                'Вам непросто было зайти в группу?',
                'Что вам больше всего нравится в вашей работе?',
                'Чем вы любите заниматься на выходных?',
                'Вы тоже не смогли подключиться к Wi-Fi?',
                'Что интересного произошло с тех пор, как мы связывались в последний раз?',
                'Вы не поверите, что случилось со мной сегодня на работе!',
                'Знаете почему маленькие собачки такие злые? Они, сука, концентрированные.',
                'Такое хорошее спокойное место, что даже матом ругаться не хочется.',
                'Я ждал, что кто нибудь из вас напишет первым, но на этот раз, так уж и быть, я сделаю это за вас!',
                'У меня не очень хорошо получается возобновлять разговор. Может быть, ты попробуешь?'
                ]